<font size='4'>**Problem statement:** Prepare Invoices data for analysis by removing or modifying the raw data. Combine different datasets based on relationships.</font>

<br/><br/>

In [3]:
# Importing libraries.
import wget
import numpy as np
import pandas as pd

In [4]:
# Ignoring warnings.
import warnings
warnings.filterwarnings('ignore')

In [5]:
file_name  = "Invoices.csv"
zenodo_url = "https://zenodo.org/record/4092667/files/"

In [6]:
# Downloading the file Invoices.csv from Zenodo.
wget.download(zenodo_url + file_name, "./Assets/" + file_name)

'./Assets/Invoices.csv'

In [7]:
# Loading the downloaded file into dataframe.
df = pd.read_csv("./Assets/Invoices.csv")

In [8]:
# A bird's eye view on the dataframe.
df.head(3)

,Order Id,Date,Meal Id,Company Id,Date of Meal,Participants,Meal Price,Type of Meal
0,839FKFW2LLX4LMBB,27-05-2016,INBUX904GIHI8YBD,LJKS5NK6788CYMUU,2016-05-31 07:00:00+02:00,['David Bishop'],469,Breakfast
1,97OX39BGVMHODLJM,27-09-2018,J0MMOOPP709DIDIE,LJKS5NK6788CYMUU,2018-10-01 20:00:00+02:00,['David Bishop'],22,Dinner
2,041ORQM5OIHTIU6L,24-08-2014,E4UJLQNCI16UX5CS,LJKS5NK6788CYMUU,2014-08-23 14:00:00+02:00,['Karen Stansell'],314,Lunch

In [9]:
df.shape

(50017, 8)

In [10]:
df.columns

Index(['Order Id', 'Date', 'Meal Id', 'Company Id', 'Date of Meal',
       'Participants', 'Meal Price', 'Type of Meal'],
      dtype='object')

In [11]:
df.dtypes

Order Id        object
Date            object
Meal Id         object
Company Id      object
Date of Meal    object
Participants    object
Meal Price       int64
Type of Meal    object
dtype: object

### Checking for  missing values.

#### Note: Missing value imputation is a basic task. But it holds the lion's share of significance in Data Munging.

In [12]:
df.isnull().sum()

Order Id        0
Date            0
Meal Id         0
Company Id      0
Date of Meal    0
Participants    0
Meal Price      0
Type of Meal    0
dtype: int64

#### No missing values!! a minor case.

### Converting data types.

<font size='3'>There are two standard ways of converting pandas data types:
1. .astype( ) conversion 
2. Helper functions, like pd.to_numeric or pd.to_datetime</font>

### 1 .astype( )

In [13]:
df['Date'] = df['Date'].astype('datetime64')
df['Meal Price'] = df['Meal Price'].astype('int64')
df['Type of Meal'] = df['Type of Meal'].astype('category')
df.dtypes

Order Id                object
Date            datetime64[ns]
Meal Id                 object
Company Id              object
Date of Meal            object
Participants            object
Meal Price               int64
Type of Meal          category
dtype: object

In [14]:
df.select_dtypes(include = 'category').head()

  Type of Meal
0    Breakfast
1       Dinner
2        Lunch
3       Dinner
4        Lunch

<font size='3'>**2. Conversion helper functions**
1. pd.to_numeric()
2. pd.to_datetime()
3. pd.to_timedelta()</font>

#### 1. Handling using pd.to_numeric()

In [15]:
df.loc[45612,'Meal Price'] = 'Intrude'
df.loc[45620,'Meal Price'] = 'Invade'

In [16]:
df['Meal Price'].apply(lambda x:type(x)).value_counts()

<class 'int'>    50015
<class 'str'>        2
Name: Meal Price, dtype: int64

In [17]:
df['Meal Price'][df['Meal Price'].apply(lambda x:isinstance(x,str))]

45612    Intrude
45620     Invade
Name: Meal Price, dtype: object

In [18]:
df['Meal Price'] = pd.to_numeric(df['Meal Price'],errors = 'coerce')
df1= df[df['Meal Price'].isnull()]
df1

,Order Id,Date,Meal Id,Company Id,Date of Meal,Participants,Meal Price,Type of Meal
45612,SJA1F92KXWZDH398,2017-02-26,OOW0UEXQY5RMPPZ8,ICNGUMLKEB27T1P3,2017-03-02 20:00:00+01:00,['Betty Stroud'],NaN,Dinner
45620,2DKPL6A229CN4WH3,2014-05-22,JH8G8O5LQEUF7U3W,OJKDXPQQXYUOGGJB,2014-05-20 20:00:00+02:00,['Alex Ellis' 'Angela Aguirre'],NaN,Dinner

In [19]:
df['Meal Price']=df['Meal Price'].fillna(df['Meal Price'].median())
df['Meal Price'].astype(int)

0        469
1         22
2        314
3        438
4        690
        ...
50012      9
50013     25
50014    160
50015    497
50016    365
Name: Meal Price, Length: 50017, dtype: int32

#### 2. Handling  using pd.to_datetime()

In [20]:
print(pd.to_datetime('2020-7-26'))
print(pd.to_datetime('July, 26 2020'))

2020-07-26 00:00:00
2020-07-26 00:00:00

In [21]:
pd.to_datetime('20190108',format = '%Y%d%m')

Timestamp('2019-08-01 00:00:00')

In [22]:
pd.to_datetime('yonn 20190108',format = '%Y%d%m',exact = False)

Timestamp('2019-08-01 00:00:00')

<font size ='3'>**Accessor methods for certain data types**
1. dt
2. str
3. cat</font>

### 1. dt

#### Displaying the date property(datetime.date objects) of the underlying data.

In [24]:
df.head(3)

,Order Id,Date,Meal Id,Company Id,Date of Meal,Participants,Meal Price,Type of Meal
0,839FKFW2LLX4LMBB,2016-05-27,INBUX904GIHI8YBD,LJKS5NK6788CYMUU,2016-05-31 07:00:00+02:00,['David Bishop'],469.0,Breakfast
1,97OX39BGVMHODLJM,2018-09-27,J0MMOOPP709DIDIE,LJKS5NK6788CYMUU,2018-10-01 20:00:00+02:00,['David Bishop'],22.0,Dinner
2,041ORQM5OIHTIU6L,2014-08-24,E4UJLQNCI16UX5CS,LJKS5NK6788CYMUU,2014-08-23 14:00:00+02:00,['Karen Stansell'],314.0,Lunch

In [25]:
df['Date'].dt.date.head(3)

0    2016-05-27
1    2018-09-27
2    2014-08-24
Name: Date, dtype: object

#### Displaying the year of the datetime in the underlying data.

In [26]:
df['Date'].dt.year.head(3)

0    2016
1    2018
2    2014
Name: Date, dtype: int64

#### Displaying the day of the underlying data.

In [27]:
df['Date'].dt.day.head(3)

0    27
1    27
2    24
Name: Date, dtype: int64

#### Displaying the month of the underlying data.

In [28]:
df['Date'].dt.month.head(3)

0    5
1    9
2    8
Name: Date, dtype: int64

#### Displaying week day of the underlying data.

In [29]:
df['Date'].dt.day_name().head(3)

0      Friday
1    Thursday
2      Sunday
Name: Date, dtype: object

#### Displaying the month name of the underlying data.

In [30]:
df['Date'].dt.month_name().head(3)

0          May
1    September
2       August
Name: Date, dtype: object

#### Displaying the days in a month  of the underlying data.

In [31]:
df['Date'].dt.days_in_month.head(3)

0    31
1    30
2    31
Name: Date, dtype: int64

<font size='2'>**Note 1: nanosecond,microsecond,second,minute,hour ,day, week, month, quarter, year gets the integer of** **the corresponding frequency.**
<br>**Note 2: is_leap_year, is_month_start, is_month_end, is_quarter_start, is_quarter_end, is_year_start,is_year_end** **returnsTrue or False.**</font>

#### Selecting only those observations where underlying month is the start of the month.

In [32]:
df[df['Date'].dt.is_month_start].head(3)

,Order Id,Date,Meal Id,Company Id,Date of Meal,Participants,Meal Price,Type of Meal
9,FESGKOQN2OZZWXY3,2016-10-01,US0NQYNNHS1SQJ4S,36MFTZOYMTAJP1RK,2016-01-14 22:00:00+01:00,['Glenn Gould' 'Amanda Knowles' 'Ginger Hoagla...,451.0,Dinner
23,795SVIJKO8KS3ZEL,2015-05-01,HHTLB8M9U0TGC7Z4,H3JRC7XX7WJAD4ZO,2015-01-06 22:00:00+01:00,['Emma Steitz'],588.0,Dinner
36,1SLO340LG6K3VM71,2015-03-01,40UIN6MOZ2GO7O93,HB25MDZR0MGCQUGX,2015-01-07 07:00:00+01:00,['Anita Katayama'],749.0,Breakfast

#### Displaying the array of  the native datetime python objects.

In [33]:
df['Date'].dt.to_pydatetime()

array([datetime.datetime(2016, 5, 27, 0, 0),
       datetime.datetime(2018, 9, 27, 0, 0),
       datetime.datetime(2014, 8, 24, 0, 0), ...,
       datetime.datetime(2017, 9, 21, 0, 0),
       datetime.datetime(2018, 1, 28, 0, 0),
       datetime.datetime(2017, 6, 9, 0, 0)], dtype=object)

#### Displaying the period corresponding to the underlying datetime. Available periods are W, M, Q and Y.

In [34]:
df['Date'].dt.to_period('Q').head(3)

0    2016Q2
1    2018Q3
2    2014Q3
Name: Date, dtype: period[Q-DEC]

### 2. str

####  lower() ,upper(), title () to manage capitalization of strings. ljust(), rjust(), center() to set the alignment

In [35]:
df['Type of Meal'].str.title().head(3)

0    Breakfast
1       Dinner
2        Lunch
Name: Type of Meal, dtype: object

In [36]:
df['Type of Meal'].str.ljust(width = 15).head(3)

0    Breakfast
1    Dinner
2    Lunch
Name: Type of Meal, dtype: object

In [37]:
df['Type of Meal'].str.rjust(width = 15).head(3)

0          Breakfast
1             Dinner
2              Lunch
Name: Type of Meal, dtype: object

In [38]:
df['Type of Meal'].str.center(width = 15).head(3)

0       Breakfast
1         Dinner
2         Lunch
Name: Type of Meal, dtype: object

In [39]:
df['Type of Meal'].str.zfill(width = 15).head(3)

0    000000Breakfast
1    000000000Dinner
2    0000000000Lunch
Name: Type of Meal, dtype: object

#### startswith(), endswith(), contains() checks for the presence of a substring

In [40]:
df[df['Type of Meal'].str.endswith('ast')].head(3)

,Order Id,Date,Meal Id,Company Id,Date of Meal,Participants,Meal Price,Type of Meal
0,839FKFW2LLX4LMBB,2016-05-27,INBUX904GIHI8YBD,LJKS5NK6788CYMUU,2016-05-31 07:00:00+02:00,['David Bishop'],469.0,Breakfast
7,FM608JK1N01BPUQN,2014-08-05,E8WJZ1FOSKZD2MJN,36MFTZOYMTAJP1RK,2014-05-07 09:00:00+02:00,['Amanda Knowles' 'Cheryl Feaster' 'Ginger Hoa...,320.0,Breakfast
11,8RIGCF74GUEQHQEE,2018-07-23,5XK0KTFTD6OAP9ZP,36MFTZOYMTAJP1RK,2018-07-27 08:00:00+02:00,['Amanda Knowles'],210.0,Breakfast

In [41]:
df[df['Type of Meal'].str.startswith('ast')].head(3)

Empty DataFrame
Columns: [Order Id, Date, Meal Id, Company Id, Date of Meal, Participants, Meal Price, Type of Meal]
Index: []

In [42]:
df[df['Type of Meal'].str.contains('ast')].head(3)

,Order Id,Date,Meal Id,Company Id,Date of Meal,Participants,Meal Price,Type of Meal
0,839FKFW2LLX4LMBB,2016-05-27,INBUX904GIHI8YBD,LJKS5NK6788CYMUU,2016-05-31 07:00:00+02:00,['David Bishop'],469.0,Breakfast
7,FM608JK1N01BPUQN,2014-08-05,E8WJZ1FOSKZD2MJN,36MFTZOYMTAJP1RK,2014-05-07 09:00:00+02:00,['Amanda Knowles' 'Cheryl Feaster' 'Ginger Hoa...,320.0,Breakfast
11,8RIGCF74GUEQHQEE,2018-07-23,5XK0KTFTD6OAP9ZP,36MFTZOYMTAJP1RK,2018-07-27 08:00:00+02:00,['Amanda Knowles'],210.0,Breakfast

#### swapcase(), repeat(times) for kicks and giggles

In [43]:
df['Type of Meal'].str.swapcase().head(3)

0    bREAKFAST
1       dINNER
2        lUNCH
Name: Type of Meal, dtype: object

In [44]:
df['Type of Meal'].str.repeat(3).head(3)

0    BreakfastBreakfastBreakfast
1             DinnerDinnerDinner
2                LunchLunchLunch
Name: Type of Meal, dtype: object

### 3. cat

In [45]:
df['Type of Meal'].cat.categories

Index(['Breakfast', 'Dinner', 'Lunch'], dtype='object')

#### For quick conversion of the category into its numerical representation.

In [47]:
df['Type of Meal'].cat.codes.head(3)

0    0
1    1
2    2
dtype: int8

#### To change the existing order of the categories.

In [48]:
df['Type of Meal'].cat.reorder_categories(
    ['Lunch','Breakfast','Dinner']).head(3)

0    Breakfast
1       Dinner
2        Lunch
Name: Type of Meal, dtype: category
Categories (3, object): [Lunch, Breakfast, Dinner]

### Combining DataFrames (Vertical Stacking)

In [49]:
df.shape

(50017, 8)

In [50]:
df['Date'].dt.year.value_counts().sort_index()

2014    10069
2015    10039
2016     9857
2017     9937
2018    10115
Name: Date, dtype: int64

In [51]:
y_2014 = df[df['Date'].dt.year == 2014].copy()
y_2015 = df[df['Date'].dt.year == 2015].copy()
y_2016 = df[df['Date'].dt.year == 2016].copy()
y_2017 = df[df['Date'].dt.year == 2017].copy()
y_2018 = df[df['Date'].dt.year == 2018].copy()
y_2018.head(3)

,Order Id,Date,Meal Id,Company Id,Date of Meal,Participants,Meal Price,Type of Meal
1,97OX39BGVMHODLJM,2018-09-27,J0MMOOPP709DIDIE,LJKS5NK6788CYMUU,2018-10-01 20:00:00+02:00,['David Bishop'],22.0,Dinner
11,8RIGCF74GUEQHQEE,2018-07-23,5XK0KTFTD6OAP9ZP,36MFTZOYMTAJP1RK,2018-07-27 08:00:00+02:00,['Amanda Knowles'],210.0,Breakfast
15,N8DOG58MW238BHA9,2018-12-25,KFR2TAYXZSVCHAA2,36MFTZOYMTAJP1RK,2018-12-20 12:00:00+01:00,['Ginger Hoagland' 'Cheryl Feaster' 'Glenn Gou...,829.0,Lunch

In [52]:
pd.concat([y_2014,y_2015,y_2016,y_2017,y_2018]).head(3)

,Order Id,Date,Meal Id,Company Id,Date of Meal,Participants,Meal Price,Type of Meal
2,041ORQM5OIHTIU6L,2014-08-24,E4UJLQNCI16UX5CS,LJKS5NK6788CYMUU,2014-08-23 14:00:00+02:00,['Karen Stansell'],314.0,Lunch
3,YT796QI18WNGZ7ZJ,2014-12-04,C9SDFHF7553BE247,LJKS5NK6788CYMUU,2014-04-07 21:00:00+02:00,['Addie Patino'],438.0,Dinner
5,AT0R4DFYYAFOC88Q,2014-07-21,W48JPR1UYWJ18NC6,LJKS5NK6788CYMUU,2014-07-17 20:00:00+02:00,['David Bishop' 'Susan Guerrero' 'Karen Stanse...,181.0,Dinner

In [53]:
pd.concat([y_2014,y_2015,y_2016,y_2017,y_2018],keys = [14,15,16,17,18],names = ['year','origninal index']).head(3)

                              Order Id       Date           Meal Id  \
year origninal index
14   2                041ORQM5OIHTIU6L 2014-08-24  E4UJLQNCI16UX5CS
     3                YT796QI18WNGZ7ZJ 2014-12-04  C9SDFHF7553BE247
     5                AT0R4DFYYAFOC88Q 2014-07-21  W48JPR1UYWJ18NC6

                            Company Id               Date of Meal  \
year origninal index
14   2                LJKS5NK6788CYMUU  2014-08-23 14:00:00+02:00
     3                LJKS5NK6788CYMUU  2014-04-07 21:00:00+02:00
     5                LJKS5NK6788CYMUU  2014-07-17 20:00:00+02:00

                                                           Participants  \
year origninal index
14   2                                               ['Karen Stansell']
     3                                                 ['Addie Patino']
     5                ['David Bishop' 'Susan Guerrero' 'Karen Stanse...

                      Meal Price Type of Meal
year origninal index
14   2                     314.0        Lunch
     3                     438.0       Dinner
     5                     181.0       Dinner

### Combining Dataframes (Horizantal stacking)

#### Note: Horizontal stacking increases the variable count

In [54]:
pd.concat([y_2014,y_2015,y_2016,y_2017,y_2018],axis = 1).head(3)

,Order Id,Date,Meal Id,Company Id,Date of Meal,Participants,Meal Price,Type of Meal,Order Id,Date,...,Meal Price,Type of Meal,Order Id,Date,Meal Id,Company Id,Date of Meal,Participants,Meal Price,Type of Meal
0,NaN,NaT,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaT,...,NaN,NaN,NaN,NaT,NaN,NaN,NaN,NaN,NaN,NaN
1,NaN,NaT,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaT,...,NaN,NaN,97OX39BGVMHODLJM,2018-09-27,J0MMOOPP709DIDIE,LJKS5NK6788CYMUU,2018-10-01 20:00:00+02:00,['David Bishop'],22.0,Dinner
2,041ORQM5OIHTIU6L,2014-08-24,E4UJLQNCI16UX5CS,LJKS5NK6788CYMUU,2014-08-23 14:00:00+02:00,['Karen Stansell'],314.0,Lunch,NaN,NaT,...,NaN,NaN,NaN,NaT,NaN,NaN,NaN,NaN,NaN,NaN

### Merging

#### Loading and inspecting new data.

In [11]:
file_name1  = "OrderLeads.csv"
zenodo_url = "https://zenodo.org/record/4092667/files/"
file_name2 = "SalesTeam.csv"

In [12]:
# Downloading the files OrderLeads.csv  and SalesTeam.csv from Zenodo.
wget.download(zenodo_url + file_name1, "./Assets/" + file_name1)
wget.download(zenodo_url + file_name2, "./Assets/" + file_name2)

'./Assets/SalesTeam.csv'

In [14]:
# Loading the downloaded files into dataframe.
order= pd.read_csv("./Assets/OrderLeads.csv")
sales = pd.read_csv('Assets/SalesTeam.csv')

#### Note: We need parse dates to have consistent types with invoices, otherwise the subsequent merges would throw errors.

In [15]:
# A quick look on orders.
order.head(3)

,Order Id,Company Id,Company Name,Date,Order Value,Converted
0,80EYLOKP9E762WKG,LJKS5NK6788CYMUU,Chimera-Chasing Casbah,18-02-2017,4875,1
1,TLEXR1HZWTUTBHPB,LJKS5NK6788CYMUU,Chimera-Chasing Casbah,30-07-2015,8425,0
2,839FKFW2LLX4LMBB,LJKS5NK6788CYMUU,Chimera-Chasing Casbah,27-05-2016,4837,0

In [16]:
# A quick look on sales.
sales.head(3)

,Sales Rep,Sales Rep Id,Company Name,Company Id
0,Jessie Mcallister,97UNNAT790E0WM4N,Chimera-Chasing Casbah,LJKS5NK6788CYMUU
1,Jessie Mcallister,97UNNAT790E0WM4N,Tangential Sheds,36MFTZOYMTAJP1RK
2,Jessie Mcallister,97UNNAT790E0WM4N,Two-Mile Grab,H3JRC7XX7WJAD4ZO

In [58]:
df.head(3)

,Order Id,Date,Meal Id,Company Id,Date of Meal,Participants,Meal Price,Type of Meal
0,839FKFW2LLX4LMBB,2016-05-27,INBUX904GIHI8YBD,LJKS5NK6788CYMUU,2016-05-31 07:00:00+02:00,['David Bishop'],469.0,Breakfast
1,97OX39BGVMHODLJM,2018-09-27,J0MMOOPP709DIDIE,LJKS5NK6788CYMUU,2018-10-01 20:00:00+02:00,['David Bishop'],22.0,Dinner
2,041ORQM5OIHTIU6L,2014-08-24,E4UJLQNCI16UX5CS,LJKS5NK6788CYMUU,2014-08-23 14:00:00+02:00,['Karen Stansell'],314.0,Lunch

In [59]:
order_data=pd.merge(order,df, on = 'Order Id')
order_data.head(3)

,Order Id,Company Id_x,Company Name,Date_x,Order Value,Converted,Date_y,Meal Id,Company Id_y,Date of Meal,Participants,Meal Price,Type of Meal
0,839FKFW2LLX4LMBB,LJKS5NK6788CYMUU,Chimera-Chasing Casbah,2016-05-27,4837,0,2016-05-27,INBUX904GIHI8YBD,LJKS5NK6788CYMUU,2016-05-31 07:00:00+02:00,['David Bishop'],469.0,Breakfast
1,97OX39BGVMHODLJM,LJKS5NK6788CYMUU,Chimera-Chasing Casbah,2018-09-27,343,0,2018-09-27,J0MMOOPP709DIDIE,LJKS5NK6788CYMUU,2018-10-01 20:00:00+02:00,['David Bishop'],22.0,Dinner
2,041ORQM5OIHTIU6L,LJKS5NK6788CYMUU,Chimera-Chasing Casbah,2014-08-24,4185,0,2014-08-24,E4UJLQNCI16UX5CS,LJKS5NK6788CYMUU,2014-08-23 14:00:00+02:00,['Karen Stansell'],314.0,Lunch

In [60]:
pd.merge(order_data,df.rename(columns = {'Order Id' : 'New id'}), left_on = 'Order Id',right_on = 'New id', how = 'left').head(3)

,Order Id,Company Id_x,Company Name,Date_x,Order Value,Converted,Date_y,Meal Id_x,Company Id_y,Date of Meal_x,...,Meal Price_x,Type of Meal_x,New id,Date,Meal Id_y,Company Id,Date of Meal_y,Participants_y,Meal Price_y,Type of Meal_y
0,839FKFW2LLX4LMBB,LJKS5NK6788CYMUU,Chimera-Chasing Casbah,2016-05-27,4837,0,2016-05-27,INBUX904GIHI8YBD,LJKS5NK6788CYMUU,2016-05-31 07:00:00+02:00,...,469.0,Breakfast,839FKFW2LLX4LMBB,2016-05-27,INBUX904GIHI8YBD,LJKS5NK6788CYMUU,2016-05-31 07:00:00+02:00,['David Bishop'],469.0,Breakfast
1,97OX39BGVMHODLJM,LJKS5NK6788CYMUU,Chimera-Chasing Casbah,2018-09-27,343,0,2018-09-27,J0MMOOPP709DIDIE,LJKS5NK6788CYMUU,2018-10-01 20:00:00+02:00,...,22.0,Dinner,97OX39BGVMHODLJM,2018-09-27,J0MMOOPP709DIDIE,LJKS5NK6788CYMUU,2018-10-01 20:00:00+02:00,['David Bishop'],22.0,Dinner
2,041ORQM5OIHTIU6L,LJKS5NK6788CYMUU,Chimera-Chasing Casbah,2014-08-24,4185,0,2014-08-24,E4UJLQNCI16UX5CS,LJKS5NK6788CYMUU,2014-08-23 14:00:00+02:00,...,314.0,Lunch,041ORQM5OIHTIU6L,2014-08-24,E4UJLQNCI16UX5CS,LJKS5NK6788CYMUU,2014-08-23 14:00:00+02:00,['Karen Stansell'],314.0,Lunch

### Lookup Dataframe

In [61]:
lookup = sales.set_index('Company Name')['Sales Rep']
order['Sales Rep'] = order['Company Name'].map(lookup)
order.head(3)

,Order Id,Company Id,Company Name,Date,Order Value,Converted,Sales Rep
0,80EYLOKP9E762WKG,LJKS5NK6788CYMUU,Chimera-Chasing Casbah,2017-02-18,4875,1,Jessie Mcallister
1,TLEXR1HZWTUTBHPB,LJKS5NK6788CYMUU,Chimera-Chasing Casbah,2015-07-30,8425,0,Jessie Mcallister
2,839FKFW2LLX4LMBB,LJKS5NK6788CYMUU,Chimera-Chasing Casbah,2016-05-27,4837,0,Jessie Mcallister

### Reshaping DataFrames (melt, pivot, transpose, stack, unstack)

In [62]:
df.head(7).T

,0,1,2,3,4,5,6
Order Id,839FKFW2LLX4LMBB,97OX39BGVMHODLJM,041ORQM5OIHTIU6L,YT796QI18WNGZ7ZJ,6YLROQT27B6HRF4E,AT0R4DFYYAFOC88Q,2DDN2LHS7G85GKPQ
Date,2016-05-27 00:00:00,2018-09-27 00:00:00,2014-08-24 00:00:00,2014-12-04 00:00:00,2015-07-28 00:00:00,2014-07-21 00:00:00,2014-04-29 00:00:00
Meal Id,INBUX904GIHI8YBD,J0MMOOPP709DIDIE,E4UJLQNCI16UX5CS,C9SDFHF7553BE247,48EQXS6IHYNZDDZ5,W48JPR1UYWJ18NC6,1MKLAKBOE3SP7YUL
Company Id,LJKS5NK6788CYMUU,LJKS5NK6788CYMUU,LJKS5NK6788CYMUU,LJKS5NK6788CYMUU,LJKS5NK6788CYMUU,LJKS5NK6788CYMUU,LJKS5NK6788CYMUU
Date of Meal,2016-05-31 07:00:00+02:00,2018-10-01 20:00:00+02:00,2014-08-23 14:00:00+02:00,2014-04-07 21:00:00+02:00,2015-07-27 14:00:00+02:00,2014-07-17 20:00:00+02:00,2014-04-30 21:00:00+02:00
Participants,['David Bishop'],['David Bishop'],['Karen Stansell'],['Addie Patino'],['Addie Patino' 'Susan Guerrero'],['David Bishop' 'Susan Guerrero' 'Karen Stanse...,['Susan Guerrero' 'David Bishop']
Meal Price,469,22,314,438,690,181,14
Type of Meal,Breakfast,Dinner,Lunch,Dinner,Lunch,Dinner,Dinner

In [63]:
melt_exp = pd.merge(
    df,
    pd.get_dummies(df['Type of Meal']).mul(df['Meal Price'].values,axis = 0),
    left_index = True,
    right_index = True
                  )
melt_exp.head(3)

,Order Id,Date,Meal Id,Company Id,Date of Meal,Participants,Meal Price,Type of Meal,Breakfast,Dinner,Lunch
0,839FKFW2LLX4LMBB,2016-05-27,INBUX904GIHI8YBD,LJKS5NK6788CYMUU,2016-05-31 07:00:00+02:00,['David Bishop'],469.0,Breakfast,469.0,0.0,0.0
1,97OX39BGVMHODLJM,2018-09-27,J0MMOOPP709DIDIE,LJKS5NK6788CYMUU,2018-10-01 20:00:00+02:00,['David Bishop'],22.0,Dinner,0.0,22.0,0.0
2,041ORQM5OIHTIU6L,2014-08-24,E4UJLQNCI16UX5CS,LJKS5NK6788CYMUU,2014-08-23 14:00:00+02:00,['Karen Stansell'],314.0,Lunch,0.0,0.0,314.0

In [64]:
del melt_exp['Type of Meal']
del melt_exp['Meal Price']
melt_exp.head(3)

,Order Id,Date,Meal Id,Company Id,Date of Meal,Participants,Breakfast,Dinner,Lunch
0,839FKFW2LLX4LMBB,2016-05-27,INBUX904GIHI8YBD,LJKS5NK6788CYMUU,2016-05-31 07:00:00+02:00,['David Bishop'],469.0,0.0,0.0
1,97OX39BGVMHODLJM,2018-09-27,J0MMOOPP709DIDIE,LJKS5NK6788CYMUU,2018-10-01 20:00:00+02:00,['David Bishop'],0.0,22.0,0.0
2,041ORQM5OIHTIU6L,2014-08-24,E4UJLQNCI16UX5CS,LJKS5NK6788CYMUU,2014-08-23 14:00:00+02:00,['Karen Stansell'],0.0,0.0,314.0

In [66]:
pd.melt(
    frame = melt_exp,
    id_vars = ['Order Id','Date','Meal Id','Company Id','Date of Meal','Participants'],
    value_vars = ['Breakfast','Dinner','Lunch'],
    var_name = 'Type of Meal',
    value_name = 'Expenses'
).head(3)

,Order Id,Date,Meal Id,Company Id,Date of Meal,Participants,Type of Meal,Expenses
0,839FKFW2LLX4LMBB,2016-05-27,INBUX904GIHI8YBD,LJKS5NK6788CYMUU,2016-05-31 07:00:00+02:00,['David Bishop'],Breakfast,469.0
1,97OX39BGVMHODLJM,2018-09-27,J0MMOOPP709DIDIE,LJKS5NK6788CYMUU,2018-10-01 20:00:00+02:00,['David Bishop'],Breakfast,0.0
2,041ORQM5OIHTIU6L,2014-08-24,E4UJLQNCI16UX5CS,LJKS5NK6788CYMUU,2014-08-23 14:00:00+02:00,['Karen Stansell'],Breakfast,0.0

### Pivot

In [67]:
pd.pivot_table(
    df,
    index = ['Company Id'],
    columns = ['Type of Meal'],
    values = 'Meal Price',
    aggfunc = np.mean,
    margins = True
    ).head(3)

Type of Meal       Breakfast      Dinner       Lunch         All
Company Id
007RF0BCBVMXTL80  301.666667  453.000000  112.000000  373.500000
00CVEIVO8C92FFBO  346.500000  425.000000  426.428571  403.285714
00OFNRZV8983KC3L  571.500000  665.333333  357.000000  550.428571

In [69]:
temp = df.groupby(['Company Id', 'Type of Meal']).agg({'Meal Price':np.mean})
temp.unstack().head(3)

                  Meal Price
Type of Meal       Breakfast      Dinner       Lunch
Company Id
007RF0BCBVMXTL80  301.666667  453.000000  112.000000
00CVEIVO8C92FFBO  346.500000  425.000000  426.428571
00OFNRZV8983KC3L  571.500000  665.333333  357.000000

In [70]:
temp.unstack(level = 'Type of Meal').head(3)

                  Meal Price
Type of Meal       Breakfast      Dinner       Lunch
Company Id
007RF0BCBVMXTL80  301.666667  453.000000  112.000000
00CVEIVO8C92FFBO  346.500000  425.000000  426.428571
00OFNRZV8983KC3L  571.500000  665.333333  357.000000

In [71]:
stack_test = df.groupby(['Company Id','Type of Meal']).agg({
    'Meal Price' : [max,min,np.mean],
    'Date of Meal':[max,min]
    
})
stack_test.head(3)

                              Meal Price                     \
                                     max    min        mean
Company Id       Type of Meal
007RF0BCBVMXTL80 Breakfast         545.0   74.0  301.666667
                 Dinner            729.0  156.0  453.000000
                 Lunch             112.0  112.0  112.000000

                                            Date of Meal  \
                                                     max
Company Id       Type of Meal
007RF0BCBVMXTL80 Breakfast     2015-09-17 08:00:00+02:00
                 Dinner        2018-09-25 22:00:00+02:00
                 Lunch         2015-11-27 13:00:00+01:00


                                                     min
Company Id       Type of Meal
007RF0BCBVMXTL80 Breakfast     2014-01-10 08:00:00+01:00
                 Dinner        2014-12-29 21:00:00+01:00
                 Lunch         2015-11-27 13:00:00+01:00

In [72]:
stack_test.stack()

                                                 Date of Meal  Meal Price
Company Id       Type of Meal
007RF0BCBVMXTL80 Breakfast    max   2015-09-17 08:00:00+02:00  545.000000
                              mean                        NaN  301.666667
                              min   2014-01-10 08:00:00+01:00   74.000000
                 Dinner       max   2018-09-25 22:00:00+02:00  729.000000
                              mean                        NaN  453.000000
...                                                       ...         ...
ZZYB9JLJKXRH7U6O Dinner       mean                        NaN  336.000000
                              min   2014-05-11 21:00:00+02:00  244.000000
                 Lunch        max   2018-08-14 14:00:00+02:00  207.000000
                              mean                        NaN  149.000000
                              min   2018-03-04 13:00:00+01:00   91.000000

[41403 rows x 2 columns]

<br/><br/>

<font size='4'>**Final thoughts:** Data preparation which is comprised of, inter alia, data cleaning, data fusion and data augumentation is often dubbed as routine and boring. It is notoriously known for guzzling major chunk of Analysts' time and effort. Inspite of that, it is advisable to perform these tasks religiously as they decide the fate of the end solution. </font>